# -*- coding: utf-8 -*-
def make_unicode(word_list):
    uni_word=[]
    for i in word_list:
        uni_word.append(unicode(i,"utf-8"))
    return uni_word

def get_e_word():
    e_word = ['환경', '활동', '경영', '정보', '환경성', '이해관계자', '평가', '관련', '관리', '프로그램', '구축', '대응', '성과', '시스템', '의사결정', '참여', '내부', '고려', '방법', '보고', '개선', '작성', '영향', '효율', '결과', '적극', '실행', '회계', '발생', '지속', '확보', '정기', '반영', '생산', '산업', '체계', '신뢰', '수립', '국내외', '이행', '공급', '특성', '가능성', '계획', '목적', '과정', '업체', '비용', '환경문제', '온실가스', '공유', '변화', '활용', '커뮤니케이션', '여부', '물질', '요구', '체제', '법규', '모색', '검증', '자발', '수준', '기준', '중요성', '예방', '조치', '상호', '범위', '전략', '의견', '분석', '구성원', '목표', '접근', '전체', '배출', '측면', '독려', '포괄', '요구사항', '관심', '수렴', '교류', '파악', '에너지', '규제', '효익', '비교', '명료', '준수', '관련성', '설립', '지침', '점검', '객관', '측정', '적용', '방안', '이슈', '환경오염', '수단', '사전', '사고', '수익', '증가', '검토', '유형', '통합', '역할', '단계', '적절', '외적인', '절감', '방침', '원가', '원인', '메커니즘', '달성', '전반', '가치', '간접', '외적', '분야', '속성', '적정', '잠재', '폐기물', '환경보호', '근거', '기후변화', '채택', '여야', '사후', '위반', '항목', '비상', '국내', '추진', '공식']
    return make_unicode(e_word)

def get_s_word():
    s_word = ['지역', '사회', '소비자', '제품', '서비스', '제공', '협력', '통해', '지원', '거래', '투자', '교육', '기여', '보건', '행위', '발전', '근로자', '기반', '사용', '시설', '노력', '개발', '경제', '기술', '고용', '기회', '주민', '프로그램', '문화', '안전', '결정', '노동', '자원', '구매', '개인', '위험', '공개', '조건', '우선', '향상', '관계', '소득', '프로젝트', '보상', '해결', '불만', '금지', '아동', '의사소통', '방식', '협의', '계층', '의견', '절차', '인식', '촉진', '재산권', '차별', '순위', '정책', '납품', '지식', '존중', '가격', '경쟁', '도움', '보장', '공정', '계약', '부패', '대표', '장려', '실시', '예방', '증대', '취하', '형성', '직원', '대금', '분쟁', '외주', '위험성', '효과', '제한', '단체', '제시', '상황', '지향', '지적', '접근성', '모든', '실현', '선택', '수집', '접근', '시한', '국제', '사의', '유산', '보존', '질병', '소통', '최대한', '사유', '능력', '합리', '기준', '방지', '남용', '도모', '주어', '직업', '기본', '조항', '피해', '판매', '기간', '원칙', '충족', '처리', '노사', '관행', '시스템', '합법', '일반', '불공정', '문제', '보증', '조달', '광고', '훈련', '인권', '방향', '중간', '천연', '예상', '표준', '요소', '피드백', '증진', '취약', '이상', '근무', '현황', '파트너', '건강']
    return make_unicode(s_word)

def get_g_word():
    g_word = ['기업', '감사', '공시', '사항', '위원회', '주주', '투자자', '경우', '기관', '외부', '지배구조', '행사', '이사회', '이해관계자', '내용', '채권자', '이사', '주권', '독립성', '마련', '이용', '재무', '수행', '규준', '모범', '위해', '보호', '규정', '사외이사', '지위', '책임', '자신', '감시', '업무', '권리', '권고', '공개', '영진', '시장', '책임자', '운영', '근로자', '유지', '포함', '의사결정', '주식', '관계', '보고서', '제도', '판단', '보수', '직무', '예측', '법령', '다른', '보유', '이익', '조직', '회사', '합병', '변경', '주요', '장치', '선임', '기준', '의무', '지배', '진의', '로서', '인수', '법률', '회의', '대상', '주주총회', '구성', '위원', '접근', '확인', '내부감사', '영향력', '자료', '이용자', '실질', '이해관계', '영업', '사전', '부서', '역할', '대표이사', '권한', '설명', '특정', '초래', '제정', '중요', '전담', '주의', '자문', '훼손', '재산', '결의', '방어', '참석', '기구', '변동', '설치', '담당', '가능성', '전문성', '서비스', '상세', '외국인', '기능', '개별', '비밀', '기재', '차원', '사업', '의결권', '필요', '분기', '시간', '부여', '추천', '소유', '구조', '회계감사', '구체', '분할', '손해', '부담', '갑질', '막말', '폭언', '폭행']
    return make_unicode(g_word)